
__author__ = 'Гриненко Алексей Валерьевич'

# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:
# 	Код: a == a**2
# 	Результат: True
# 	Код: a == a*2
# 	Результат: True
# 	Код: a > 999999
# 	Результат: True


#Ответ: inf
#Проверка:

a = float('inf')

if a == a**2:
  print("True")
  
if a == a*2:
  print("True")
  
if a > 999999:
  print("True")




# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?

# Подсказка: это значение точно есть ;)
